app/controllers/resorts_controller.rb

SELECT "resorts".* FROM "resorts" WHERE "resorts"."latitude" IS NOT NULL AND "resorts"."longitude" IS NOT NULL
SELECT "resorts".* FROM "resorts" INNER JOIN "feature_resorts" ON "feature_resorts"."resort_id" = "resorts"."id" INNER JOIN "features" ON "features"."id" = "feature_resorts"."feature_id" WHERE "resorts"."latitude" IS NOT NULL AND "resorts"."longitude" IS NOT NULL AND (country ILIKE '%Indonesia%' OR continent ILIKE '%Indonesia%') AND (features.name ILIKE '%Yoga%')
---
  def index
    @resorts = Resort.where.not(latitude: nil, longitude: nil)


    if params[:location].present?
      sql_query = "country ILIKE :location OR continent ILIKE :location"
      @resorts = @resorts.where(sql_query, location: "%#{params[:location]}%")
    end

    if params[:feature].present?
       sql_query = "features.name ILIKE :feature"
      @resorts = @resorts.joins(:features).where(sql_query, feature: "%#{params[:feature]}%")
    end

      @markers = @resorts.map do |resort|

SELECT  "resorts".* FROM "resorts" WHERE "resorts"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def set_resort
    @resort = Resort.find(params[:id])